package aurora.universe.universes.tarotmaster;

import android.content.DialogInterface;
import android.os.Bundle;
import android.support.annotation.Nullable;
import android.support.v7.app.AlertDialog;
import android.support.v7.app.AppCompatActivity;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.ListView;

/**
 * Created by miguelduarte on 4/11/2020.
 */

public class CautionListActivity extends AppCompatActivity {
    ListView listView;

    @Override
    protected void onCreate(@Nullable Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_caution_list);

        listView = (ListView)findViewById(R.id.caution_list);
        ArrayAdapter<CharSequence> adapter = ArrayAdapter.createFromResource(
                this, R.array.cautions, R.layout.caution_list_item
        );
        listView.setAdapter(adapter);
        listView.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {
                AlertDialog dialog = new AlertDialog.Builder(CautionListActivity.this).create();
                if (position == 0)
                {
                    dialog.setTitle("塔罗九戒");
                    dialog.setMessage(
                            "第一条：我将秉持客观及怜悯的态度诚实而完整的解读塔罗牌。\n" +
                                    "\n" +
                                    "第二条：我的目的是向我的求问者提供引导以便于他们在成长时做出对他们最有利的决定，我同时将努力地帮他们洞悉问题的症结并在每次解读时给予他们希望。\n" +
                                    "\n" +
                                    "第三条：对于我的塔罗牌将随时给予尊重并且行为要专业，并遵守关于塔罗牌的一切伦理方面的戒律。\n" +
                                    "\n" +
                                    "第四条：如果我解读塔罗牌的行为是收费的，我将在一开始便公开的说明，也不会有任何额外的收费。\n" +
                                    "\n" +
                                    "第五条：我在学习塔罗牌时愿意保证不外泄教学内容及一切机密，除非是我或他人身处于危险或恐吓中，或是我得到允许；如果在解读时遇到危险，我将确保我的求问者处于安全的处境。\n" +
                                    "\n" +
                                    "第六条：如果我的求问者的问题属于法律、精神疾病、财政或是医学等方面的专业性问题，并非我能解决的，我将请他们去求教相关的专业人士。我也需鼓励他们改善自己的生活，为此我将准备一些资源提供他们参考。\n" +
                                    "\n" +
                                    "第七条：我不会谈论关于财富的问题，因为在解读塔罗牌时，每个人都将为所解读的事情负责。我相信人们的未来是由自己创造的，我也将以塔罗牌来教育我的求问者什么是可以做的，什么是不能做的。\n" +
                                    "\n" +
                                    "第八条：我是解读求问者要求解读的部分，我也不会泄露给第三者知道，但是如果必要，我将改变原有的措辞给其他人知道籍以帮助我的求问者。\n" +
                                    "\n" +
                                    "第九条：我将努力地在塔罗牌上钻研知识及学问，并努力去实践他们。\n" +
                                    "\n" +
                                    "——American Tarot Association，ATA制定\n" +
                                    "\n" +
                                    "\n" +
                                    "\n" +
                                    "新九戒\n" +
                                    "第一条、我将秉持客观及\"同理心\"的态度，诚实且依照\"当事人的承受能力\"来解读塔罗牌。\n" +
                                    "\n" +
                                    "第二条、我的目的是协助求问者\"了解不同角度与行动下的风险分析\"，以便于他们在此问题下，\"能做出不伤害他人却对自己最有利的决定\"，我同时将努力地帮他们洞悉问题的症结，并在每次解读时给予他们努力改善成长的空间。\n" +
                                    "\n" +
                                    "第三条、对于塔罗的相关人事物，\"合于正道者\"，将给予尊重。自身的行为必须合乎专业表现，并遵守关于塔罗的一切伦理方面的戒律。\n" +
                                    "\n" +
                                    "第四条、如果我解读塔罗牌的行为是收费的，我将在一开始便公开的说明并询问求问者的意愿，当其愿意接受此一费用才进行相关解读，事后，也不会有任何额外收费。 「此外费用将合理收取且求问者能负担的范围内」。\n" +
                                    "\n" +
                                    "第五条、我在学习塔罗相关知识时，愿意保证不对外透露教学内容及一切机密，除非是我或他人身处于危险或恐吓中，或是我得到我的老师允许；\"如果在解读时遇到危险，应确保求问者与自身的安全无虞\"。\n" +
                                    "\n" +
                                    "第六条、如果我的求问者的问题是属于法律、精神病、财政或是医学等的专业问题，\"并非用塔罗牌或自身能力能够改善的，我将请他们去求助相关的专业人士\"。我也必需鼓励他们改善自己的生活，为此我提升自己的能力并将准备一些资源提供他们参考。　　\n" +
                                    "\n" +
                                    "第七条、\"我不会谈论关于命定论的问题\"，因为与其抱怨自己的现状比不上他人，不如了解哪方面可以帮自己过的更好，当解读塔罗牌时，每个人都将为所解读的事情负责，包含求问者与占卜分析师，我相信我们的未来是由自己创造的，我也将以塔罗牌来教育我的求问者什么是该努力的，什么是该珍惜的。\n" +
                                    "\n" +
                                    "第八条、所有以的规范都比不上守密重要，对此，我不会泄漏任何求问者的资料与解释的内容给第三者知道，当求问者要求只要解读部分的呈现的讯息，我将只解读求问者要求解读的部分，若求问者需要第三者的说明，如专业的律师与医生，我将征求求问者的同意后，才可以将相关讯息透露给第三者了解。\n" +
                                    "\n" +
                                    "第九条、我将努力地在塔罗上钻研知识及学问，并努力去实践它们。对于过分神怪、装神弄鬼的塔罗方面讯息，用心思考去分辨真假且避免这些学问影响初学的朋友。\n");
                }
                else if (position == 1)
                {
                    dialog.setTitle("如何问一个好问题");
                    dialog.setMessage(
                            "        对于初入门的学习者，有一个观念绝对要记得，塔罗牌提供的答案并不是唯一的结果，也不是所谓的注定，而是「照这个情势演变下去而不加人力改变，所得到的结果」。 打个比喻来说，我们可以将人生看成一个多重结局的电脑游戏，玩家做的每个选择都导向不同的结局，而塔罗牌就是作弊的工具，可以偷偷告诉玩家「照他目前的选择走下去会得到何种结局」。玩家如果对结局不满意，随时可以改变。真正的结果还是掌握在自己手中。 因此，在问问题的时候，最重要的是要找出一个对当事人最有帮助的问题，要让当事人能够尽人事，得到最好的结果，比如说，与其问「我跟他是不是会分手？」而束手待毙，不如问「我该如何改善我们的关系？」或是「照目前这个状况看来，我跟他未来的发展如何？」。与其问「我今年能不能获得升迁？」，不如问「我该如何做，才能在今年获得升迁？」 \n" +
                                    "       最理想的问题，应该是要能帮助你看清局势，找出症结，采取合宜对策，无论打算放弃、努力还是换个方法，都期望可在能力内达到最好结果。 \n" +
                                    "       除了这个最重要的核心观念之外，还有一些初学者常犯的技术性毛病，兹说明如下。 \n" +
                                    "\n" +
                                    "1 要明确，不可太笼统 \n" +
                                    "       愈明确的问题，就会得到愈明确的结果。如果只是很摸糊的问「我的爱情运如何？」，那也只会得到很笼统的答案而已。 \n" +
                                    "\n" +
                                    "2 要短期，不可太长期 \n" +
                                    "       有些人以为塔罗牌可以算出一辈子的事情，这是大错特错。塔罗牌是面对特定问题寻求答案的「占卜」，不是综观天生性格与后天连势的「命理」。所以你可以问「我跟某甲吵架该如何解决？」或「两个工作机会我该选哪一个？」，而不能问塔罗牌「我这辈子嫁不嫁得出去？」或「我今生的老公会不会是外国人？」。对于可能要两年之后才会发生的事，变数太大，也不宜占卜。 \n" +
                                    "\n" +
                                    "3 不要问与自己无直接相关的问题 \n" +
                                    "       塔罗牌占卜时，最好让与问题直接相关的人抽牌，否则也必须请与问题密切相关的人抽牌才可以，否则不会准确。比方说，如果随便找一个路人来抽牌占卜中东战事的发展，你抽到太阳，我抽到恶魔，他抽到世界，全世界每个人抽一张，人人不同，这该如何解释？面对这种问题，必须请美国总统、伊拉克总统，或是国家级的大臣将领来抽牌，才有意义，因为他们才是与这个间题直接相关的人。 \n" +
                                    "       再举一个例子，如果想知道某甲与他父亲的相处状况，必须请某甲或他父亲来抽牌。如果某甲的母亲夹在他们中间做调人，则请她来抽牌，也可以接受，因为她和这个问题也有密切的相关。 \n" +
                                    "       所以我们应该避免问与自己无密切相关的问题，诸如隔壁邻居现在的感情状况如何，十年没见的老朋友现在财务状况如何，或是各种国运天下事，除非能找到当事人亲自抽牌，否则都不应占卜，即使卜了，准确率也跟猜的没两样。 \n" +
                                    "       （补充：现在流行的远程占卜可以让塔罗师直接代抽，另外许多占卜网站也可以在线抽牌。）\n" +
                                    "\n" +
                                    "4 不要问过去的事 \n" +
                                    "       过去的事已经发生了，无论怎么算都无法改变，也没有意义。反倒是占卜过去事情的问卜心态，好像在测试塔罗牌的准确度。抱持这样不认真的心态，算出来的答案通常不会准确。 \n" +
                                    "\n" +
                                    "5 不要让塔罗牌为你做决定 \n" +
                                    "       初学者常拿着塔罗牌东问西问，大至人生方向，小至午餐要吃什么、衣服要穿什么都问。很多事情明明可以凭理智来做决定，他却让塔罗牌替他决定，这等于放弃了自由意志。在占卜时，从塔罗牌中能够得到启发，把问题看得更清楚，但最终的决定权，还是得牢牢把握住。 \n" +
                                    "       还有一些问题是可以靠自我要求来达成的，诸如「我这个月减肥会不会成功？」或「我这门课会不会不及格？」。如果问了这类的问题，等于放弃了努力，塔罗牌会成为阻碍你成长的绊脚石。 \n" +
                                    "\n" +
                                    "6 不要把牌人格化 \n" +
                                    "       虽然现代人讲究科学，但还是有不少人相信牌中住有精灵，或是牌有它自己的个性，有人会问：「牌啊，我们初次见面，你的个性是什么？」、「牌啊，你是不是被我问得很烦了？」或「牌啊，我能不能再买一副新牌？」，诸如此类的问题，让人哭笑不得。 \n" +
                                    "       我们可以将塔罗牌视为人生路上的好朋友，但不要当真以为牌有脾气有个性。假使我们在庙里求签，或用三枚钱币占卜易经，那签和钱币都只是工具，没有人会将那些工具人格化。它们之所以会准确，力量来自使用的人，切勿本末倒置，让自己被塔罗牌所控制。 \n" +
                                    "\n" +
                                    "7 审慎询问健康问题 \n" +
                                    "       一般而言，健康问题最好询问专业的医师，不要问塔罗牌。可以接受的状况则是在占卜检视自己的身心状况或一年运势时，可能会出现某些牌，指出你身上某个地方可能出了问题。在了解之后，也必须自行好好保养照顾，才是真正有益的占卜。 ");
                }


                dialog.setButton(DialogInterface.BUTTON_NEGATIVE, "知道了",
                        (DialogInterface.OnClickListener) null);
                dialog.show();
            }
        });
    }


}
